MikroElektronika/core_packages/PIC/XC8/def/PIC12LF1552/mcu.h
// Register: AADRES0H
#define AADRES0H AADRES0H
extern volatile unsigned char           AADRES0H            __at(0x71B);
#ifndef _LIB_BUILD
asm("AADRES0H equ 071Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRES0H                :8;
    };
} AADRES0Hbits_t;
extern volatile AADRES0Hbits_t AADRES0Hbits __at(0x71B);
// bitfield macros
#define _AADRES0H_ADRES0H_POSN                              0x0
#define _AADRES0H_ADRES0H_POSITION                          0x0
#define _AADRES0H_ADRES0H_SIZE                              0x8
#define _AADRES0H_ADRES0H_LENGTH                            0x8
#define _AADRES0H_ADRES0H_MASK                              0xFF

// Register: AADRES1
#define AADRES1 AADRES1
extern volatile unsigned short          AADRES1             __at(0x71C);
#ifndef _LIB_BUILD
asm("AADRES1 equ 071Ch");
#endif
// aliases
extern volatile unsigned short          AD1RES1             __at(0x71C);
#ifndef _LIB_BUILD
asm("AD1RES1 equ 071Ch");
#endif
extern volatile unsigned short          ADRES1              __at(0x71C);
#ifndef _LIB_BUILD
asm("ADRES1 equ 071Ch");
#endif

// Register: AADRES1L
#define AADRES1L AADRES1L
extern volatile unsigned char           AADRES1L            __at(0x71C);
#ifndef _LIB_BUILD
asm("AADRES1L equ 071Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRES1L                :8;
    };
} AADRES1Lbits_t;
extern volatile AADRES1Lbits_t AADRES1Lbits __at(0x71C);
// bitfield macros
#define _AADRES1L_ADRES1L_POSN                              0x0
#define _AADRES1L_ADRES1L_POSITION                          0x0
#define _AADRES1L_ADRES1L_SIZE                              0x8
#define _AADRES1L_ADRES1L_LENGTH                            0x8
#define _AADRES1L_ADRES1L_MASK                              0xFF

// Register: AADRES1H
#define AADRES1H AADRES1H
extern volatile unsigned char           AADRES1H            __at(0x71D);
#ifndef _LIB_BUILD
asm("AADRES1H equ 071Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRES1H                :8;
    };
} AADRES1Hbits_t;
extern volatile AADRES1Hbits_t AADRES1Hbits __at(0x71D);
// bitfield macros
#define _AADRES1H_ADRES1H_POSN                              0x0
#define _AADRES1H_ADRES1H_POSITION                          0x0
#define _AADRES1H_ADRES1H_SIZE                              0x8
#define _AADRES1H_ADRES1H_LENGTH                            0x8
#define _AADRES1H_ADRES1H_MASK                              0xFF

/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&07Fh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&07FFh)
#endif
// SSP1CON2<ACKDT>
extern volatile __bit                   ACKDT               __at(0x10B5);	// @ (0x216 * 8 + 5)
#define                                 ACKDT_bit           _BIT_ACCESS(SSP1CON2,5)
// SSP1CON2<ACKEN>
extern volatile __bit                   ACKEN               __at(0x10B4);	// @ (0x216 * 8 + 4)
#define                                 ACKEN_bit           _BIT_ACCESS(SSP1CON2,4)
// SSP1CON2<ACKSTAT>
extern volatile __bit                   ACKSTAT             __at(0x10B6);	// @ (0x216 * 8 + 6)
#define                                 ACKSTAT_bit         _BIT_ACCESS(SSP1CON2,6)
// SSP1CON3<ACKTIM>
extern volatile __bit                   ACKTIM              __at(0x10BF);	// @ (0x217 * 8 + 7)
#define                                 ACKTIM_bit          _BIT_ACCESS(SSP1CON3,7)
// AADACQ<ADACQ0>
extern volatile __bit                   ADACQ0              __at(0x38B8);	// @ (0x717 * 8 + 0)
#define                                 ADACQ0_bit          _BIT_ACCESS(AADACQ,0)
// AADACQ<ADACQ1>
extern volatile __bit                   ADACQ1              __at(0x38B9);	// @ (0x717 * 8 + 1)
#define                                 ADACQ1_bit          _BIT_ACCESS(AADACQ,1)
// AADACQ<ADACQ2>
extern volatile __bit                   ADACQ2              __at(0x38BA);	// @ (0x717 * 8 + 2)
#define                                 ADACQ2_bit          _BIT_ACCESS(AADACQ,2)
// AADACQ<ADACQ3>
extern volatile __bit                   ADACQ3              __at(0x38BB);	// @ (0x717 * 8 + 3)
#define                                 ADACQ3_bit          _BIT_ACCESS(AADACQ,3)
// AADACQ<ADACQ4>
extern volatile __bit                   ADACQ4              __at(0x38BC);	// @ (0x717 * 8 + 4)
#define                                 ADACQ4_bit          _BIT_ACCESS(AADACQ,4)
// AADACQ<ADACQ5>
extern volatile __bit                   ADACQ5              __at(0x38BD);	// @ (0x717 * 8 + 5)
#define                                 ADACQ5_bit          _BIT_ACCESS(AADACQ,5)
// AADACQ<ADACQ6>
extern volatile __bit                   ADACQ6              __at(0x38BE);	// @ (0x717 * 8 + 6)
#define                                 ADACQ6_bit          _BIT_ACCESS(AADACQ,6)
// AADSTAT<ADCONV>
extern volatile __bit                   ADCONV              __at(0x38AA);	// @ (0x715 * 8 + 2)
#define                                 ADCONV_bit          _BIT_ACCESS(AADSTAT,2)
// AADCAP<ADDCAP0>
extern volatile __bit                   ADDCAP0             __at(0x38C8);	// @ (0x719 * 8 + 0)
#define                                 ADDCAP0_bit         _BIT_ACCESS(AADCAP,0)
// AADCAP<ADDCAP1>
extern volatile __bit                   ADDCAP1             __at(0x38C9);	// @ (0x719 * 8 + 1)
#define                                 ADDCAP1_bit         _BIT_ACCESS(AADCAP,1)
// AADCAP<ADDCAP2>
extern volatile __bit                   ADDCAP2             __at(0x38CA);	// @ (0x719 * 8 + 2)
#define                                 ADDCAP2_bit         _BIT_ACCESS(AADCAP,2)
// AADCON3<ADDSEN>
extern volatile __bit                   ADDSEN              __at(0x38A0);	// @ (0x714 * 8 + 0)
#define                                 ADDSEN_bit          _BIT_ACCESS(AADCON3,0)
// AADCON3<ADEPPOL>
extern volatile __bit                   ADEPPOL             __at(0x38A7);	// @ (0x714 * 8 + 7)
#define                                 ADEPPOL_bit         _BIT_ACCESS(AADCON3,7)
// FVRCON<ADFVR0>
extern volatile __bit                   ADFVR0              __at(0x8B8);	// @ (0x117 * 8 + 0)
#define                                 ADFVR0_bit          _BIT_ACCESS(FVRCON,0)
// FVRCON<ADFVR1>
extern volatile __bit                   ADFVR1              __at(0x8B9);	// @ (0x117 * 8 + 1)
#define                                 ADFVR1_bit          _BIT_ACCESS(FVRCON,1)
// ADCON0<ADGO>
extern volatile __bit                   ADGO                __at(0x4E9);	// @ (0x9D * 8 + 1)
#define                                 ADGO_bit            _BIT_ACCESS(ADCON0,1)
// PIE1<ADIE>
extern volatile __bit                   ADIE                __at(0x48E);	// @ (0x91 * 8 + 6)
#define                                 ADIE_bit            _BIT_ACCESS(PIE1,6)
// PIR1<ADIF>
extern volatile __bit                   ADIF                __at(0x8E);	// @ (0x11 * 8 + 6)
#define                                 ADIF_bit            _BIT_ACCESS(PIR1,6)
// AADCON3<ADIPEN>
extern volatile __bit                   ADIPEN              __at(0x38A1);	// @ (0x714 * 8 + 1)
#define                                 ADIPEN_bit          _BIT_ACCESS(AADCON3,1)
// AADCON3<ADIPPOL>
extern volatile __bit                   ADIPPOL             __at(0x38A6);	// @ (0x714 * 8 + 6)
#define                                 ADIPPOL_bit         _BIT_ACCESS(AADCON3,6)
// AADCON3<ADOEN>
extern volatile __bit                   ADOEN               __at(0x38A4);	// @ (0x714 * 8 + 4)
#define                                 ADOEN_bit           _BIT_ACCESS(AADCON3,4)
// AADCON3<ADOOEN>
extern volatile __bit                   ADOOEN              __at(0x38A3);	// @ (0x714 * 8 + 3)
#define                                 ADOOEN_bit          _BIT_ACCESS(AADCON3,3)
// AADPRE<ADPRE0>
extern volatile __bit                   ADPRE0              __at(0x38B0);	// @ (0x716 * 8 + 0)
#define                                 ADPRE0_bit          _BIT_ACCESS(AADPRE,0)
// AADPRE<ADPRE1>
extern volatile __bit                   ADPRE1              __at(0x38B1);	// @ (0x716 * 8 + 1)
#define                                 ADPRE1_bit          _BIT_ACCESS(AADPRE,1)
// AADPRE<ADPRE2>
extern volatile __bit                   ADPRE2              __at(0x38B2);	// @ (0x716 * 8 + 2)
#define                                 ADPRE2_bit          _BIT_ACCESS(AADPRE,2)
// AADPRE<ADPRE3>
extern volatile __bit                   ADPRE3              __at(0x38B3);	// @ (0x716 * 8 + 3)
#define                                 ADPRE3_bit          _BIT_ACCESS(AADPRE,3)
// AADPRE<ADPRE4>
extern volatile __bit                   ADPRE4              __at(0x38B4);	// @ (0x716 * 8 + 4)
#define                                 ADPRE4_bit          _BIT_ACCESS(AADPRE,4)
// AADPRE<ADPRE5>
extern volatile __bit                   ADPRE5              __at(0x38B5);	// @ (0x716 * 8 + 5)
#define                                 ADPRE5_bit          _BIT_ACCESS(AADPRE,5)
// AADPRE<ADPRE6>
extern volatile __bit                   ADPRE6              __at(0x38B6);	// @ (0x716 * 8 + 6)
#define                                 ADPRE6_bit          _BIT_ACCESS(AADPRE,6)
// AADSTAT<ADSTG0>
extern volatile __bit                   ADSTG0              __at(0x38A8);	// @ (0x715 * 8 + 0)
#define                                 ADSTG0_bit          _BIT_ACCESS(AADSTAT,0)
// AADSTAT<ADSTG1>
extern volatile __bit                   ADSTG1              __at(0x38A9);	// @ (0x715 * 8 + 1)
#define                                 ADSTG1_bit          _BIT_ACCESS(AADSTAT,1)
// SSP1CON3<AHEN>
extern volatile __bit                   AHEN                __at(0x10B9);	// @ (0x217 * 8 + 1)
#define                                 AHEN_bit            _BIT_ACCESS(SSP1CON3,1)
// ANSELA<ANSA0>
extern volatile __bit                   ANSA0               __at(0xC60);	// @ (0x18C * 8 + 0)
#define                                 ANSA0_bit           _BIT_ACCESS(ANSELA,0)
// ANSELA<ANSA1>
extern volatile __bit                   ANSA1               __at(0xC61);	// @ (0x18C * 8 + 1)
#define                                 ANSA1_bit           _BIT_ACCESS(ANSELA,1)
// ANSELA<ANSA2>
extern volatile __bit                   ANSA2               __at(0xC62);	// @ (0x18C * 8 + 2)
#define                                 ANSA2_bit           _BIT_ACCESS(ANSELA,2)
// ANSELA<ANSA4>
extern volatile __bit                   ANSA4               __at(0xC64);	// @ (0x18C * 8 + 4)
#define                                 ANSA4_bit           _BIT_ACCESS(ANSELA,4)
// ANSELA<ANSA5>
extern volatile __bit                   ANSA5               __at(0xC65);	// @ (0x18C * 8 + 5)
#define                                 ANSA5_bit           _BIT_ACCESS(ANSELA,5)
// PIE2<BCL1IE>
extern volatile __bit                   BCL1IE              __at(0x493);	// @ (0x92 * 8 + 3)
#define                                 BCL1IE_bit          _BIT_ACCESS(PIE2,3)
// PIR2<BCL1IF>
extern volatile __bit                   BCL1IF              __at(0x93);	// @ (0x12 * 8 + 3)
#define                                 BCL1IF_bit          _BIT_ACCESS(PIR2,3)
// SSP1STAT<BF>
extern volatile __bit                   BF                  __at(0x10A0);	// @ (0x214 * 8 + 0)
#define                                 BF_bit              _BIT_ACCESS(SSP1STAT,0)
// SSP1CON3<BOEN>
extern volatile __bit                   BOEN                __at(0x10BC);	// @ (0x217 * 8 + 4)
#define                                 BOEN_bit            _BIT_ACCESS(SSP1CON3,4)
// BORCON<BORFS>
extern volatile __bit                   BORFS               __at(0x8B6);	// @ (0x116 * 8 + 6)
#define                                 BORFS_bit           _BIT_ACCESS(BORCON,6)
// BORCON<BORRDY>
extern volatile __bit                   BORRDY              __at(0x8B0);	// @ (0x116 * 8 + 0)
#define                                 BORRDY_bit          _BIT_ACCESS(BORCON,0)
// BSR<BSR0>
extern volatile __bit                   BSR0                __at(0x40);	// @ (0x8 * 8 + 0)
#define                                 BSR0_bit            _BIT_ACCESS(BSR,0)
// BSR<BSR1>
extern volatile __bit                   BSR1                __at(0x41);	// @ (0x8 * 8 + 1)
#define                                 BSR1_bit            _BIT_ACCESS(BSR,1)
// BSR<BSR2>
extern volatile __bit                   BSR2                __at(0x42);	// @ (0x8 * 8 + 2)
#define                                 BSR2_bit            _BIT_ACCESS(BSR,2)
// BSR<BSR3>
extern volatile __bit                   BSR3                __at(0x43);	// @ (0x8 * 8 + 3)
#define                                 BSR3_bit            _BIT_ACCESS(BSR,3)
// BSR<BSR4>
extern volatile __bit                   BSR4                __at(0x44);	// @ (0x8 * 8 + 4)
#define                                 BSR4_bit            _BIT_ACCESS(BSR,4)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// PMCON1<CFGS>
extern volatile __bit                   CFGS                __at(0xCAE);	// @ (0x195 * 8 + 6)
#define                                 CFGS_bit            _BIT_ACCESS(PMCON1,6)
// SSP1STAT<CKE>
extern volatile __bit                   CKE                 __at(0x10A6);	// @ (0x214 * 8 + 6)
#define                                 CKE_bit             _BIT_ACCESS(SSP1STAT,6)
// SSP1CON1<CKP>
extern volatile __bit                   CKP                 __at(0x10AC);	// @ (0x215 * 8 + 4)
#define                                 CKP_bit             _BIT_ACCESS(SSP1CON1,4)
// STATUS_SHAD<C_SHAD>
extern volatile __bit                   C_SHAD              __at(0x7F20);	// @ (0xFE4 * 8 + 0)
#define                                 C_SHAD_bit          _BIT_ACCESS(STATUS_SHAD,0)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// STATUS_SHAD<DC_SHAD>
extern volatile __bit                   DC_SHAD             __at(0x7F21);	// @ (0xFE4 * 8 + 1)
#define                                 DC_SHAD_bit         _BIT_ACCESS(STATUS_SHAD,1)
// SSP1CON3<DHEN>
extern volatile __bit                   DHEN                __at(0x10B8);	// @ (0x217 * 8 + 0)
#define                                 DHEN_bit            _BIT_ACCESS(SSP1CON3,0)
// SSP1STAT<D_nA>
extern volatile __bit                   D_nA                __at(0x10A5);	// @ (0x214 * 8 + 5)
#define                                 D_nA_bit            _BIT_ACCESS(SSP1STAT,5)
// PMCON1<FREE>
extern volatile __bit                   FREE                __at(0xCAC);	// @ (0x195 * 8 + 4)
#define                                 FREE_bit            _BIT_ACCESS(PMCON1,4)
// FVRCON<FVREN>
extern volatile __bit                   FVREN               __at(0x8BF);	// @ (0x117 * 8 + 7)
#define                                 FVREN_bit           _BIT_ACCESS(FVRCON,7)
// FVRCON<FVRRDY>
extern volatile __bit                   FVRRDY              __at(0x8BE);	// @ (0x117 * 8 + 6)
#define                                 FVRRDY_bit          _BIT_ACCESS(FVRCON,6)
// SSP1CON2<GCEN>
extern volatile __bit                   GCEN                __at(0x10B7);	// @ (0x216 * 8 + 7)
#define                                 GCEN_bit            _BIT_ACCESS(SSP1CON2,7)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x5F);	// @ (0xB * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// ADCON0<GO>
extern volatile __bit                   GO                  __at(0x4E9);	// @ (0x9D * 8 + 1)
#define                                 GO_bit              _BIT_ACCESS(ADCON0,1)
// AADGRD<GRDAOE>
extern volatile __bit                   GRDAOE              __at(0x38C6);	// @ (0x718 * 8 + 6)
#define                                 GRDAOE_bit          _BIT_ACCESS(AADGRD,6)
// AADGRD<GRDBOE>
extern volatile __bit                   GRDBOE              __at(0x38C7);	// @ (0x718 * 8 + 7)
#define                                 GRDBOE_bit          _BIT_ACCESS(AADGRD,7)
// AADGRD<GRDPOL>
extern volatile __bit                   GRDPOL              __at(0x38C5);	// @ (0x718 * 8 + 5)
#define                                 GRDPOL_bit          _BIT_ACCESS(AADGRD,5)
// OSCSTAT<HFIOFR>
extern volatile __bit                   HFIOFR              __at(0x4D4);	// @ (0x9A * 8 + 4)
#define                                 HFIOFR_bit          _BIT_ACCESS(OSCSTAT,4)
// OSCSTAT<HFIOFS>
extern volatile __bit                   HFIOFS              __at(0x4D0);	// @ (0x9A * 8 + 0)
#define                                 HFIOFS_bit          _BIT_ACCESS(OSCSTAT,0)
// INTCON<INTE>
extern volatile __bit                   INTE                __at(0x5C);	// @ (0xB * 8 + 4)
#define                                 INTE_bit            _BIT_ACCESS(INTCON,4)
// OPTION_REG<INTEDG>
extern volatile __bit                   INTEDG              __at(0x4AE);	// @ (0x95 * 8 + 6)
#define                                 INTEDG_bit          _BIT_ACCESS(OPTION_REG,6)
// INTCON<INTF>
extern volatile __bit                   INTF                __at(0x59);	// @ (0xB * 8 + 1)
#define                                 INTF_bit            _BIT_ACCESS(INTCON,1)
// IOCAF<IOCAF0>
extern volatile __bit                   IOCAF0              __at(0x1C98);	// @ (0x393 * 8 + 0)
#define                                 IOCAF0_bit          _BIT_ACCESS(IOCAF,0)
// IOCAF<IOCAF1>
extern volatile __bit                   IOCAF1              __at(0x1C99);	// @ (0x393 * 8 + 1)
#define                                 IOCAF1_bit          _BIT_ACCESS(IOCAF,1)
// IOCAF<IOCAF2>
extern volatile __bit                   IOCAF2              __at(0x1C9A);	// @ (0x393 * 8 + 2)
#define                                 IOCAF2_bit          _BIT_ACCESS(IOCAF,2)
// IOCAF<IOCAF3>
extern volatile __bit                   IOCAF3              __at(0x1C9B);	// @ (0x393 * 8 + 3)
#define                                 IOCAF3_bit          _BIT_ACCESS(IOCAF,3)
// IOCAF<IOCAF4>
extern volatile __bit                   IOCAF4              __at(0x1C9C);	// @ (0x393 * 8 + 4)
#define                                 IOCAF4_bit          _BIT_ACCESS(IOCAF,4)
// IOCAF<IOCAF5>
extern volatile __bit                   IOCAF5              __at(0x1C9D);	// @ (0x393 * 8 + 5)
#define                                 IOCAF5_bit          _BIT_ACCESS(IOCAF,5)
// IOCAN<IOCAN0>
extern volatile __bit                   IOCAN0              __at(0x1C90);	// @ (0x392 * 8 + 0)
#define                                 IOCAN0_bit          _BIT_ACCESS(IOCAN,0)
// IOCAN<IOCAN1>
extern volatile __bit                   IOCAN1              __at(0x1C91);	// @ (0x392 * 8 + 1)
#define                                 IOCAN1_bit          _BIT_ACCESS(IOCAN,1)
// IOCAN<IOCAN2>
extern volatile __bit                   IOCAN2              __at(0x1C92);	// @ (0x392 * 8 + 2)
#define                                 IOCAN2_bit          _BIT_ACCESS(IOCAN,2)
// IOCAN<IOCAN3>
extern volatile __bit                   IOCAN3              __at(0x1C93);	// @ (0x392 * 8 + 3)
#define                                 IOCAN3_bit          _BIT_ACCESS(IOCAN,3)
// IOCAN<IOCAN4>
extern volatile __bit                   IOCAN4              __at(0x1C94);	// @ (0x392 * 8 + 4)
#define                                 IOCAN4_bit          _BIT_ACCESS(IOCAN,4)
// IOCAN<IOCAN5>
extern volatile __bit                   IOCAN5              __at(0x1C95);	// @ (0x392 * 8 + 5)
#define                                 IOCAN5_bit          _BIT_ACCESS(IOCAN,5)
// IOCAP<IOCAP0>
extern volatile __bit                   IOCAP0              __at(0x1C88);	// @ (0x391 * 8 + 0)
#define                                 IOCAP0_bit          _BIT_ACCESS(IOCAP,0)
// IOCAP<IOCAP1>
extern volatile __bit                   IOCAP1              __at(0x1C89);	// @ (0x391 * 8 + 1)
#define                                 IOCAP1_bit          _BIT_ACCESS(IOCAP,1)
// IOCAP<IOCAP2>
extern volatile __bit                   IOCAP2              __at(0x1C8A);	// @ (0x391 * 8 + 2)
#define                                 IOCAP2_bit          _BIT_ACCESS(IOCAP,2)
// IOCAP<IOCAP3>
extern volatile __bit                   IOCAP3              __at(0x1C8B);	// @ (0x391 * 8 + 3)
#define                                 IOCAP3_bit          _BIT_ACCESS(IOCAP,3)
// IOCAP<IOCAP4>
extern volatile __bit                   IOCAP4              __at(0x1C8C);	// @ (0x391 * 8 + 4)
#define                                 IOCAP4_bit          _BIT_ACCESS(IOCAP,4)
// IOCAP<IOCAP5>
extern volatile __bit                   IOCAP5              __at(0x1C8D);	// @ (0x391 * 8 + 5)
#define                                 IOCAP5_bit          _BIT_ACCESS(IOCAP,5)
// INTCON<IOCIE>
extern volatile __bit                   IOCIE               __at(0x5B);	// @ (0xB * 8 + 3)
#define                                 IOCIE_bit           _BIT_ACCESS(INTCON,3)
// INTCON<IOCIF>
extern volatile __bit                   IOCIF               __at(0x58);	// @ (0xB * 8 + 0)
#define                                 IOCIF_bit           _BIT_ACCESS(INTCON,0)
// OSCCON<IRCF0>
extern volatile __bit                   IRCF0               __at(0x4CB);	// @ (0x99 * 8 + 3)
#define                                 IRCF0_bit           _BIT_ACCESS(OSCCON,3)
// OSCCON<IRCF1>
extern volatile __bit                   IRCF1               __at(0x4CC);	// @ (0x99 * 8 + 4)
#define                                 IRCF1_bit           _BIT_ACCESS(OSCCON,4)
// OSCCON<IRCF2>
extern volatile __bit                   IRCF2               __at(0x4CD);	// @ (0x99 * 8 + 5)
#define                                 IRCF2_bit           _BIT_ACCESS(OSCCON,5)
// OSCCON<IRCF3>
extern volatile __bit                   IRCF3               __at(0x4CE);	// @ (0x99 * 8 + 6)
#define                                 IRCF3_bit           _BIT_ACCESS(OSCCON,6)
// LATA<LATA0>
extern volatile __bit                   LATA0               __at(0x860);	// @ (0x10C * 8 + 0)
#define                                 LATA0_bit           _BIT_ACCESS(LATA,0)
// LATA<LATA1>
extern volatile __bit                   LATA1               __at(0x861);	// @ (0x10C * 8 + 1)
#define                                 LATA1_bit           _BIT_ACCESS(LATA,1)
// LATA<LATA2>
extern volatile __bit                   LATA2               __at(0x862);	// @ (0x10C * 8 + 2)
#define                                 LATA2_bit           _BIT_ACCESS(LATA,2)
// LATA<LATA4>
extern volatile __bit                   LATA4               __at(0x864);	// @ (0x10C * 8 + 4)
#define                                 LATA4_bit           _BIT_ACCESS(LATA,4)
// LATA<LATA5>
extern volatile __bit                   LATA5               __at(0x865);	// @ (0x10C * 8 + 5)
#define                                 LATA5_bit           _BIT_ACCESS(LATA,5)
// OSCSTAT<LFIOFR>
extern volatile __bit                   LFIOFR              __at(0x4D1);	// @ (0x9A * 8 + 1)
#define                                 LFIOFR_bit          _BIT_ACCESS(OSCSTAT,1)
// PMCON1<LWLO>
extern volatile __bit                   LWLO                __at(0xCAD);	// @ (0x195 * 8 + 5)
#define                                 LWLO_bit            _BIT_ACCESS(PMCON1,5)
// OSCSTAT<OSTS>
extern volatile __bit                   OSTS                __at(0x4D5);	// @ (0x9A * 8 + 5)
#define                                 OSTS_bit            _BIT_ACCESS(OSCSTAT,5)
// SSP1CON3<PCIE>
extern volatile __bit                   PCIE                __at(0x10BE);	// @ (0x217 * 8 + 6)
#define                                 PCIE_bit            _BIT_ACCESS(SSP1CON3,6)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// SSP1CON2<PEN>
extern volatile __bit                   PEN                 __at(0x10B2);	// @ (0x216 * 8 + 2)
